{
  "types": [
    {
      "id": 1,
      "code": "cat",
      "name": "ネコ星紋タイプ",
      "title": "マイペースクリエイター",
      "summary": "自分のペースと好きな世界を何より大事にしながら、生き方そのものをデザインしていく星紋タイプです。ひとり時間と少人数の深い人間関係を大切にし、興味のある分野では誰よりも深く潜っていきます。",
      "personality": "マイペースで感性が鋭く、心から興味を持てるテーマに出会うと、一気に集中力と行動力が高まります。一方で、義務感だけで動くことにはエンジンがかかりづらく、合わない環境からは静かにフェードアウトしがちです。",
      "loveStyle": "恋愛は慎重スタート型で、少しずつ距離を縮めていきたいタイプです。ベタベタしすぎる関係よりも、程よい距離感を保ちながら、安心して本音を出せる相手を求めます。メッセージの頻度よりも、会ったときの空気感や沈黙の心地よさを大事にしがちです。",
      "workStyle": "決められた手順だけを繰り返すより、自分なりの工夫やセンスを混ぜられる仕事に向いています。クリエイティブ職や企画、技術職、接客でも自分の色を出せる環境との相性が良好です。",
      "stressSigns": "返信が極端に遅くなる、趣味への興味が薄れる、休んでも疲れが抜けないときは要注意です。なんとなく人と会うのが面倒になってきたら、心が先に限界を迎えているサインです。",
      "healingTips": "誰とも会わない日をあえて作ることや、スマホ通知を切って好きなものだけに浸る時間を確保することが、星紋のバランスを整える鍵になります。小さくてもいいので、自分だけの巣になる場所を持つと回復が早まります。",
      "lifeStory": {
        "childhood": "子どものころから好き嫌いがはっきりしていて、ひとり遊びや創作に没頭する時間が多い星紋です。周りに合わせるより、自分の世界をじっくり育てる傾向があります。",
        "teen": "10代後半は世界が一気に広がり、背伸びした世界と本音でいられる世界の両方を体験しやすい時期です。ここでの経験が、後の恋愛観や仕事観のベースになっていきます。",
        "twenties": "20代は、自分の感性と現実とのギャップに気づき始めるタイミングです。合わない環境を手放し、心から続けたいことだけを残していく流れが入りやすく、仕事や人間関係の選び直しが起きやすい星回りです。",
        "thirties": "30代は、20代で選び直したものを長く続ける形に整えるステージです。仕事・恋愛・暮らし方のバランスを自分仕様にカスタマイズしていく運気で、無理を減らし自分のペースに合わせるほど生きやすさが増していきます。",
        "fortiesPlus": "40代以降は、これまで積み重ねてきた感性と経験が周りから頼られる形で活かされます。無理をやめて自分のペースを許せるほど、心地よい人間関係と暮らしが固まっていきます。若い頃よりも自分が好きと言える状態を目指せる星紋です."
      },
      "marriageChances": [
        {
          "label": "18〜19歳ごろ",
          "text": "学生時代の出会いから、もし続いていたら結婚もありえたかもと後から振り返るようなご縁が生まれやすいタイミングです。恋愛観や好きな人のタイプの原型になりやすい相手が現れます。"
        },
        {
          "label": "23〜25歳ごろ",
          "text": "社会に出て少し落ち着いた頃、生活リズムや価値観が近い相手と縁がつながりやすくなります。一緒にいると暮らしのイメージが具体的に湧くようなパートナー候補が現れやすい時期です。"
        },
        {
          "label": "28〜30歳ごろ",
          "text": "仕事や将来設計を現実的に考え始めるタイミングで、現実面と感性のバランスが良い相手とのご縁が強まります。同棲や結婚など、関係性が一段進むことも多いでしょう。"
        },
        {
          "label": "35〜38歳ごろ",
          "text": "安心感や生活の安定を最優先にできる時期で、落ち着いたご縁や再会からのご縁が生まれやすくなります。この頃の出会いは、この人となら年を重ねていけそうと感じる相手になりやすい星回りです。"
        }
      ],
      "turningPoints": [
        {
          "ageHint": "20代後半",
          "text": "合わない環境や人間関係を手放し、自分にとって本当に必要なものだけを残していくターニングポイントです。ここでの選択が30代以降の生きやすさに大きく影響します。"
        },
        {
          "ageHint": "30代前半",
          "text": "この先10年、何を大事にするかを決める時期です。仕事・恋愛・家族・趣味のどこに一番エネルギーを注ぐかをはっきりさせることで、運の流れが整っていきます。"
        },
        {
          "ageHint": "40〜41歳ごろ",
          "text": "体力やメンタル、お金の流れを長期戦モードに切り替える節目です。生活リズムや働き方を整えることで、この先の20年がぐっと過ごしやすくなります。"
        }
      ],
      "compatibility": {
        "goodMatchLove": ["dog", "dolphin", "koala"],
        "bestMarriage": ["dog", "bear", "penguin"],
        "excitingButTiring": ["fox", "wolf"],
        "difficultMatch": ["squirrel"]
      }
    },
    {
      "id": 2,
      "code": "dog",
      "name": "イヌ星紋タイプ",
      "title": "誠実サポーター",
      "summary": "約束や責任を重んじ、人との信頼関係を何よりも大切にする星紋タイプです。まっすぐさと面倒見の良さで、周りから自然と頼られることが多いでしょう。",
      "personality": "正直で誠実、任されたことを途中で投げ出さない粘り強さを持っています。自分よりも周りの人の状況を優先しがちで、ときに頑張りすぎてしまうこともあります。",
      "loveStyle": "恋愛では一途で、パートナーを全力で支えようとします。その一方で、相手に尽くしすぎて自分の感情を後回しにしてしまうこともあります。安心感のある関係を好み、遊びよりも真剣な付き合いを求めるタイプです。",
      "workStyle": "チームワークを重視し、人の役に立っている実感があると力を発揮します。サポート役や調整役が向いており、地道な努力をコツコツ積み重ねる仕事との相性が良いです。",
      "stressSigns": "断れない用事が増えたときや、頼られ続けて自分の時間が減ってきたときにストレスが溜まりやすくなります。疲れているのについ予定を詰め込んでしまうのも要注意のサインです。",
      "healingTips": "一人で抱え込まず、信頼できる人に弱音を吐くことが大切です。完璧であろうとせず、できないことはできないと言う練習をすることで、心の負担が軽くなっていきます。",
      "lifeStory": {
        "childhood": "小さい頃から周りの空気を読み、家族や友だちの間をうまく取り持つ役目を担いやすい星紋です。人から頼られる経験が早いうちから多くなりがちです。",
        "teen": "10代では部活やクラスなど、集団の中で責任ある立場を任されることが増えます。頑張りすぎることで疲れが溜まりやすい時期でもあり、自分の限界を知ることがテーマになりやすいでしょう。",
        "twenties": "20代は、誰のために頑張るのかを選び直す流れが入りやすい時期です。仕事でも恋愛でも、ただ期待に応えるのではなく、自分が本当に守りたい人や居場所がどこかを見つめ直すタイミングとなります。",
        "thirties": "30代は、信頼できる人間関係と安定した土台を固めていくステージです。家族やパートナーシップ、仕事仲間との関係を通じて、自分なりの幸せの形が見えてきます。",
        "fortiesPlus": "40代以降は、これまで培ってきた誠実さと信頼が、人を支え導く力として発揮されていきます。無理を重ねるよりも、自分のペースを大切にしながら、人とのつながりを楽しめる時期です。"
      },
      "marriageChances": [
        {
          "label": "20〜22歳ごろ",
          "text": "学生から社会人へと移るタイミングで、価値観や生活リズムの近い相手とのご縁が生まれやすい時期です。将来を意識した真面目な交際が始まりやすい流れがあります。"
        },
        {
          "label": "26〜29歳ごろ",
          "text": "仕事や生活の基盤が整ってくる頃、結婚を具体的に考えやすい相手との出会いが増えていきます。職場や友人の紹介など、身近な縁からパートナーが現れやすいタイミングです。"
        },
        {
          "label": "32〜35歳ごろ",
          "text": "守りたいものがはっきりしてくる時期で、家族像や暮らし方を共有できる相手とのご縁が強まります。再会や紹介をきっかけとした落ち着いた恋愛が結婚につながりやすい流れです."
        },
        {
          "label": "40歳前後",
          "text": "仕事や家庭のバランスを見直す中で、人生のパートナーとして信頼できる相手との縁が生まれやすい時期です。若い頃とは違う価値観で、お互いを支え合う関係を築きやすくなります。"
        }
      ],
      "turningPoints": [
        {
          "ageHint": "20代前半",
          "text": "人の期待に応えるだけでなく、自分が本当に続けたい道を選び直すターニングポイントです。ここでの選択が、その後の働き方や人間関係に強く影響します。"
        },
        {
          "ageHint": "30歳前後",
          "text": "生活の基盤と人間関係をどこに置くかを決める時期です。家族、仕事、住む場所などを含め、自分が守りたいものが輪郭を持ち始めます。"
        },
        {
          "ageHint": "40代前半",
          "text": "これまでの頑張り方を見直し、無理をしないスタイルへと切り替える節目です。頼られることと、自分を大切にすることのバランスを整えることで、心が楽になっていきます。"
        }
      ],
      "compatibility": {
        "goodMatchLove": ["cat", "rabbit", "koala"],
        "bestMarriage": ["cat", "penguin", "bear"],
        "excitingButTiring": ["fox", "dolphin"],
        "difficultMatch": ["hedgehog"]
      }
    },
    {
      "id": 3,
      "code": "rabbit",
      "name": "ウサギ星紋タイプ",
      "title": "共感ピュアハート",
      "summary": "人の気持ちにとても敏感で、優しさと気配りにあふれた星紋タイプです。周りの空気を素早く察知し、場を和ませたり相手を思いやったりすることが自然とできる人です。",
      "personality": "繊細で感受性が豊かで、小さな変化にも気づきやすい面があります。その分、人の言葉や表情に影響を受けやすく、傷つきやすさも抱えていますが、その心の柔らかさが大きな魅力でもあります。",
      "loveStyle": "恋愛では相手を優先しがちで、自分の気持ちを後回しにしてしまうことがあります。穏やかで安心できる関係を望み、強く押されるよりも、そっと寄り添ってくれる相手との相性が良いタイプです。",
      "workStyle": "人の気持ちを汲み取る力が仕事でも活きます。接客や教育、福祉、クリエイティブ系の仕事など、人との関わりや感性が求められる分野に向いています。一方で、緊張感の高い環境が長く続くと疲れやすくなります。",
      "stressSigns": "周りの雰囲気が悪いと、自分が悪いのではないかと感じてしまうことがあります。眠りが浅くなったり、小さなことで涙が出たりしたら、心が疲れているサインです。",
      "healingTips": "安心できる少人数の人間関係を大切にし、無理に大勢の場に出続けないことがポイントです。自然の多い場所でのんびり過ごしたり、好きな音楽や香りで気持ちを落ち着ける時間を作ると回復しやすくなります。",
      "lifeStory": {
        "childhood": "幼い頃から周りの大人や友だちの感情に敏感で、場の空気を読むことが自然と身についていきます。マイペースに遊べる環境や、安心できる大人の存在に支えられやすい星紋です。",
        "teen": "10代は、友人関係や恋愛を通して、人との距離感に悩みやすい時期です。自分を押し殺さずにすむ関係と、疲れてしまう関係の違いを学びやすいタイミングでもあります。",
        "twenties": "20代は、自分の優しさと繊細さをどう活かすかがテーマになります。仕事や恋愛で、無理をしてでも頑張ってしまう傾向があり、その分、自分を守る方法を覚えることが大切です。",
        "thirties": "30代は、自分を安心させてくれる居場所や人間関係を中心に生活を組み立てていくステージです。合わない人から距離を取る勇気を持つほど、心が軽くなっていきます。",
        "fortiesPlus": "40代以降は、これまでの経験から人の痛みや弱さに寄り添える力がより深まっていきます。無理をしなくても、自分らしさそのものが周囲の支えになる星紋です。"
      },
      "marriageChances": [
        {
          "label": "17〜19歳ごろ",
          "text": "初恋や学生時代の恋愛が、心の深い部分に長く影響を残しやすい時期です。結婚にはつながらなくても、将来どんな相手と一緒にいたいかのイメージが形になり始めます。"
        },
        {
          "label": "24〜27歳ごろ",
          "text": "仕事や生活リズムが落ち着き始め、将来を一緒に考えられる相手との出会いが増えるタイミングです。友人関係から恋愛に発展するパターンも起こりやすくなります。"
        },
        {
          "label": "31〜34歳ごろ",
          "text": "自分を大切にしてくれる相手かどうかを冷静に見極められる時期です。無理のない関係を選びやすく、精神的な安定をもたらしてくれるパートナーとのご縁が強まります。"
        },
        {
          "label": "39〜42歳ごろ",
          "text": "第二のスタートのようなご縁が生まれやすいタイミングです。再会や、人生経験を積んだ同士として支え合える相手との関係が結婚につながることもあります。"
        }
      ],
      "turningPoints": [
        {
          "ageHint": "10代後半",
          "text": "人間関係の中で、自分が無理なくいられる距離感や付き合い方を学ぶターニングポイントです。ここで得た感覚が、その後の人付き合いの基準になります。"
        },
        {
          "ageHint": "20代後半",
          "text": "頑張りすぎや我慢癖を手放し、自分を守る選択を覚えていく時期です。職場や恋愛などで心身の限界を知り、無理を続けないことの大切さを実感しやすい流れです。"
        },
        {
          "ageHint": "30代後半",
          "text": "自分の感受性や優しさを強みとして受け入れ、安心できる人や場所を中心に人生を組み立てていく節目です。ここでの選択が、その後の安定感につながります。"
        }
      ],
      "compatibility": {
        "goodMatchLove": ["dog", "fox", "owl"],
        "bestMarriage": ["dog", "bear", "koala"],
        "excitingButTiring": ["wolf", "dolphin"],
        "difficultMatch": ["hedgehog"]
      }
    },
    {
      "id": 4,
      "code": "fox",
      "name": "キツネ星紋タイプ",
      "title": "戦略トリックスター",
      "summary": "頭の回転が速く、状況を一歩引いて見ながら上手に立ち回る星紋タイプです。機転とひらめきに優れ、変化の多い環境でも柔軟に対応できる器用さを持っています。",
      "personality": "物事を俯瞰して見る力があり、先の展開を読むのが得意です。その一方で、本音を簡単には見せず、心の奥を打ち明けるまでに時間がかかる傾向があります。",
      "loveStyle": "恋愛では駆け引き上手な一面もあり、距離感を上手に調整しながら相手の様子をよく観察します。刺激と知的な会話を好み、飽きない関係性に魅力を感じるタイプです。",
      "workStyle": "変化や難題に強く、問題解決や企画立案など、頭を使う仕事に向いています。場の空気を読みながら、自分の立ち位置を柔軟に変えられるので、橋渡し役や調整役としても活躍しやすいでしょう。",
      "stressSigns": "周りのレベルが低く感じたり、理不尽さを強く意識したときにストレスが溜まりやすくなります。心の中で冷めた気持ちが増えてきたら要注意です。",
      "healingTips": "同じ目線で語り合える人との時間や、頭をフル回転させすぎない趣味に触れることで心が整います。何も考えなくていい時間を意識的に作ることが大切です。",
      "lifeStory": {
        "childhood": "子どもの頃から大人びた部分があり、周りをよく観察している星紋です。空気を読みすぎて、自分の本音を隠してしまうクセが早いうちから身につきやすい面があります。",
        "teen": "10代は、自分の頭の回転の速さと周囲とのギャップを感じやすい時期です。友人関係や部活などで、裏方として立ち回ることで能力が磨かれていきます。",
        "twenties": "20代は、さまざまな世界を見て経験値を増やすタイミングです。変化の多い環境に身を置くことで、対応力と戦略性がさらに鍛えられていきます。",
        "thirties": "30代は、散らばった経験を一つの軸にまとめていくステージです。自分がどこで勝負したいのか、どんな人たちと組みたいのかが明確になりやすい時期です。",
        "fortiesPlus": "40代以降は、これまで培ってきた洞察力と戦略性が、組織や周囲を導く力として発揮されます。本音を分かち合える少数の仲間を大切にすることで、心の安定も強まっていきます。"
      },
      "marriageChances": [
        {
          "label": "19〜21歳ごろ",
          "text": "学生生活の終盤や社会人の入口で、価値観の近い相手とのご縁が生まれやすい時期です。恋愛を通して、自分の本音と建前のバランスを学びやすい流れがあります。"
        },
        {
          "label": "27〜30歳ごろ",
          "text": "仕事の経験が積み上がり、自分のスタイルが固まり始めるタイミングです。将来のビジョンを共有できる相手との出会いが結婚につながりやすい時期です。"
        },
        {
          "label": "33〜36歳ごろ",
          "text": "人間関係の整理が進み、本当に大事にしたい人が見えてくるタイミングです。駆け引きよりも安心感や信頼を優先できる相手とのご縁が強まります。"
        },
        {
          "label": "42〜45歳ごろ",
          "text": "人生経験を活かしながら、第二のスタートのようなご縁が生まれやすい時期です。対等なパートナーシップを築ける相手と出会いやすい星回りです。"
        }
      ],
      "turningPoints": [
        {
          "ageHint": "20歳前後",
          "text": "自分の頭の回転の速さや感覚を活かせる環境とそうでない場所の違いを知るターニングポイントです。ここでの経験が、その後の居場所選びに影響します。"
        },
        {
          "ageHint": "30代前半",
          "text": "挑戦と安定のバランスをどう取るかを決める時期です。変化の多い働き方を続けるのか、腰を据えるのかの方向性が固まりやすい流れです。"
        },
        {
          "ageHint": "40代前半",
          "text": "自分の戦略性や洞察力を人のために使うフェーズへの切り替え時期です。個人の成果だけでなく、チームや組織全体への貢献がテーマになりやすいでしょう。"
        }
      ],
      "compatibility": {
        "goodMatchLove": ["rabbit", "cat", "wolf"],
        "bestMarriage": ["wolf", "penguin"],
        "excitingButTiring": ["dolphin", "owl"],
        "difficultMatch": ["bear"]
      }
    },
    {
      "id": 5,
      "code": "owl",
      "name": "フクロウ星紋タイプ",
      "title": "観察と知恵のナビゲーター",
      "summary": "物事をじっくり観察し、本質を見抜く洞察力に優れた星紋タイプです。感情に流されすぎず、一歩引いた視点から冷静に状況を判断することができます。",
      "personality": "思慮深く慎重で、発言する前にしっかり考えるタイプです。派手さはないものの、いざというときに的確な一言を出せるため、信頼されやすい傾向があります。",
      "loveStyle": "恋愛では、すぐには心を開かず、時間をかけて相手を見極める慎重派です。表現は控えめですが、関係が深まるほど、静かな思いやりと安心感を与えるパートナーになります。",
      "workStyle": "情報を整理したり、計画を立てたりすることが得意で、分析や企画、教育、研究などの仕事に向いています。急な変化が続く環境よりも、腰を据えて取り組める分野で力を発揮します。",
      "stressSigns": "決めるべきことが多すぎると、考えすぎて動けなくなることがあります。また、自分だけが冷静だと感じる状況が続くと、孤立感を抱きやすくなります。",
      "healingTips": "一人で考え続けるより、信頼できる人と意見交換をすることで視野が広がり、気持ちも軽くなります。書き出して整理する習慣を持つと、頭の中がクリアになりやすいでしょう。",
      "lifeStory": {
        "childhood": "幼い頃から周りをよく観察し、大人の言動や空気感を静かに見ているタイプです。自分なりの考えを早いうちから持ち始める星紋です。",
        "teen": "10代は、感情よりも理性を優先しがちで、落ち着いていると言われることが多い時期です。一方で、自分の本音を表に出す練習も必要になってきます。",
        "twenties": "20代は、多様な価値観や世界に触れ、自分の考えに幅を持たせていくタイミングです。焦らず経験を重ねることで、独自の視点が確立されていきます。",
        "thirties": "30代は、蓄えた知識と経験を具体的な形で活かすステージです。後輩指導や企画、専門分野の深掘りなど、自分の知恵を人のために使う場が増えていきます。",
        "fortiesPlus": "40代以降は、落ち着いた判断力と視野の広さが周りから頼られる力となります。慌てず騒がず、必要なときに必要な言葉を届ける存在として輝きやすい星紋です。"
      },
      "marriageChances": [
        {
          "label": "22〜25歳ごろ",
          "text": "仕事や学びの場を通じて、価値観や考え方が近い相手と出会いやすい時期です。友人関係からじわじわと恋愛に発展するパターンも起こりやすいでしょう。"
        },
        {
          "label": "29〜32歳ごろ",
          "text": "将来の暮らし方や働き方を現実的に考え始めるタイミングです。一緒に長期的な計画を立てられる相手とのご縁が結婚につながりやすい時期です。"
        },
        {
          "label": "37〜40歳ごろ",
          "text": "人生経験を積んだうえで、穏やかで安定したパートナーシップを築ける相手とのご縁が強まります。再会や紹介がきっかけになりやすい流れです。"
        },
        {
          "label": "45歳前後",
          "text": "第二の人生のパートナーとして、価値観やペースが近い相手と出会いやすいタイミングです。静かな安心感を共有できる関係になりやすい星回りです。"
        }
      ],
      "turningPoints": [
        {
          "ageHint": "20代前半",
          "text": "知識や情報を集めるだけでなく、実際に行動して経験を積むことが求められるターニングポイントです。失敗を恐れず動くことで視野が大きく広がります。"
        },
        {
          "ageHint": "30歳前後",
          "text": "自分の専門性や得意分野を絞り込み、長く続けていく軸を定める時期です。ここでの選択が、その後のキャリアの安定につながります。"
        },
        {
          "ageHint": "40代前半",
          "text": "個人としての成長から、人を導く立場へのシフトが起きやすい節目です。後輩や周囲を支えることで、自分自身の成長も加速していきます。"
        }
      ],
      "compatibility": {
        "goodMatchLove": ["rabbit", "hedgehog", "penguin"],
        "bestMarriage": ["bear", "penguin"],
        "excitingButTiring": ["fox", "wolf"],
        "difficultMatch": ["dolphin"]
      }
    },
    {
      "id": 6,
      "code": "bear",
      "name": "クマ星紋タイプ",
      "title": "どっしり守護者",
      "summary": "安定感と包容力にあふれ、周囲に安心感を与える星紋タイプです。一度決めたことをじっくり続ける忍耐力があり、頼れる存在として見られやすいでしょう。",
      "personality": "ペースはゆっくりめですが、一度動き出すと粘り強く取り組みます。慣れた環境や人間関係を大切にし、新しいことに挑戦するときも慎重に準備を整えます。",
      "loveStyle": "恋愛では真面目で、長く続く関係を望むタイプです。派手なロマンスよりも、日常の中で信頼を育てていくような関係性に向いています。嫉妬深くはありませんが、大事な人への思いはとても深いです。",
      "workStyle": "コツコツと積み上げる仕事や、長期的な視点で取り組むプロジェクトに向いています。急な変化が続く環境よりも、着実に成長していける職場で本領を発揮します。",
      "stressSigns": "急かされたり予定を詰め込まれたりすると、ペースを乱されてストレスを感じやすくなります。また、頑張っているのに評価されていないと感じると、やる気が一気に落ちることがあります。",
      "healingTips": "自分のペースで動ける時間を確保することが何より大切です。自然の中でゆっくり過ごしたり、好きなものをじっくり味わう時間を持つことで、エネルギーが戻ってきます。",
      "lifeStory": {
        "childhood": "子どもの頃から落ち着いていて、大人びていると言われやすい星紋です。慣れ親しんだ環境や家族との時間を大切にする傾向があります。",
        "teen": "10代は、周りのスピード感についていくのに少し疲れを感じることもありますが、自分のペースを守れるかどうかが大きなテーマになります。",
        "twenties": "20代は、仕事や人間関係の基盤を少しずつ固めていく時期です。焦らずじっくり取り組むことで、信用と信頼が蓄積されていきます。",
        "thirties": "30代は、家庭や仕事など、守りたいものがはっきりしてくるステージです。大切な人や場所を守るために、エネルギーの使い方を見直すタイミングが訪れます。",
        "fortiesPlus": "40代以降は、どっしりとした存在感で周りを支える役割が増えていきます。自分のペースを大切にしながら、無理なく続けられる形で人の役に立てる星紋です。"
      },
      "marriageChances": [
        {
          "label": "23〜26歳ごろ",
          "text": "仕事や生活の土台が少しずつ見え始める時期で、将来を一緒に考えられる相手との出会いが増えやすいタイミングです。安定志向の恋愛が結婚につながりやすい流れです。"
        },
        {
          "label": "29〜33歳ごろ",
          "text": "家庭や暮らし方を意識しやすい時期で、日常を共に過ごすイメージが持てる相手とのご縁が強まります。同棲や入籍など、形を整える動きが起こりやすいでしょう。"
        },
        {
          "label": "36〜40歳ごろ",
          "text": "仕事や家族とのバランスを見直しながら、第二の安定を築けるパートナーとのご縁が生まれやすいタイミングです。落ち着いた関係が結婚につながりやすい星回りです。"
        },
        {
          "label": "45〜48歳ごろ",
          "text": "人生の後半戦を一緒に歩む相手として、価値観の近いパートナーと出会いやすい時期です。再婚や再スタートのご縁にも恵まれやすいでしょう。"
        }
      ],
      "turningPoints": [
        {
          "ageHint": "20代半ば",
          "text": "自分のペースを守りながら、どんな仕事や生活スタイルを選ぶかを決めるターニングポイントです。慌てて選ぶより、じっくり考える方が後悔が少なくなります。"
        },
        {
          "ageHint": "30代前半",
          "text": "守りたいものと手放してもいいものを整理する時期です。人間関係や働き方を見直すことで、心の安定感が増していきます。"
        },
        {
          "ageHint": "40代前半",
          "text": "無理を続けるより、長く続けられる形に切り替える節目です。健康や家族との時間を意識しながら、生活のバランスを整えていく流れが訪れます。"
        }
      ],
      "compatibility": {
        "goodMatchLove": ["cat", "rabbit", "koala"],
        "bestMarriage": ["cat", "owl", "penguin"],
        "excitingButTiring": ["wolf", "fox"],
        "difficultMatch": ["squirrel"]
      }
    },
    {
      "id": 7,
      "code": "squirrel",
      "name": "リス星紋タイプ",
      "title": "コツコツプランナー",
      "summary": "計画性と貯める力に優れ、小さな積み重ねを武器にしていく星紋タイプです。将来を見据えてコツコツ準備を進めることが得意で、堅実さがあります。",
      "personality": "細かいところによく気がつき、抜けを減らす工夫が自然とできるタイプです。その一方で、予定外の出来事が続くと不安になりやすく、完璧を求めすぎて疲れることもあります。",
      "loveStyle": "恋愛では、勢いよりも慎重さが前に出やすいタイプです。相手の性格や生活感をよく観察し、安心して付き合えそうかどうかをじっくり見ます。誠実で安定した関係性を望みます。",
      "workStyle": "事務・管理・経理・進行管理など、計画性や段取り力が求められる仕事に向いています。長期的な目線で物事を進めるのが得意で、周囲からも信頼されやすいでしょう。",
      "stressSigns": "イレギュラーな対応が続いたり、自分だけが頑張っていると感じたときにストレスが溜まりやすくなります。頭の中で何度も同じ心配事を繰り返してしまうのもサインのひとつです。",
      "healingTips": "やることを書き出して優先順位を整理することで、安心感が戻りやすくなります。また、何もしない日や、予定をあえて空白にする時間を持つことで、心と体がリセットされやすくなります。",
      "lifeStory": {
        "childhood": "子どもの頃からきちんとしていると言われやすく、忘れ物やミスを減らそうと努力する星紋です。周りの期待に応えようと頑張りすぎる一面もあります。",
        "teen": "10代は、勉強や部活などでコツコツ努力する力が発揮されやすい時期です。一方で、失敗を恐れすぎるとチャレンジの機会を逃してしまうこともあります。",
        "twenties": "20代は、貯金やキャリア形成など、将来を見据えた準備が進みやすいタイミングです。少しずつ積み上げていくことで、周りとの違いが出てきます。",
        "thirties": "30代は、これまでの積み重ねが形になり、生活の安定感が増していくステージです。家族やパートナーとの関係においても、計画性が役立ちます。",
        "fortiesPlus": "40代以降は、経験を活かして人の段取りを支えたり、計画を立てる側に回ることが増えていきます。自分のペースを守りながら周囲に貢献できる星紋です。"
      },
      "marriageChances": [
        {
          "label": "21〜24歳ごろ",
          "text": "学生生活や社会人生活の初期に、価値観が近く、生活感覚が似ている相手とのご縁が生まれやすい時期です。安定志向な恋愛が始まりやすい流れです。"
        },
        {
          "label": "27〜31歳ごろ",
          "text": "将来の計画を真剣に考えるようになり、現実的な話ができる相手とのご縁が強まります。結婚や家計の話を自然にできる関係が育ちやすい時期です。"
        },
        {
          "label": "34〜37歳ごろ",
          "text": "仕事や家庭とのバランスを重視しながら、一緒に落ち着いた生活を築ける相手との出会いが期待できます。再会や紹介からのご縁も入りやすいタイミングです。"
        },
        {
          "label": "42〜45歳ごろ",
          "text": "第二の人生設計を考える中で、価値観の合うパートナーとのご縁が生まれやすい時期です。お互いの生活スタイルを尊重し合える関係を築きやすい星回りです。"
        }
      ],
      "turningPoints": [
        {
          "ageHint": "20代前半",
          "text": "完璧を目指しすぎず、失敗を許しながら前に進むことを学ぶターニングポイントです。この時期の経験が、後のチャレンジの幅を広げます。"
        },
        {
          "ageHint": "30歳前後",
          "text": "貯めるだけでなく、どこに使うかを決める時期です。時間やお金、エネルギーの使い方を見直すことで、満足度が大きく変わっていきます。"
        },
        {
          "ageHint": "40代前半",
          "text": "抱え込みすぎを手放し、人に任せることを覚える節目です。自分一人で全てを管理しなくても良いと気づけると、心がぐっと楽になります。"
        }
      ],
      "compatibility": {
        "goodMatchLove": ["rabbit", "penguin", "fox"],
        "bestMarriage": ["penguin", "bear"],
        "excitingButTiring": ["dolphin", "dog"],
        "difficultMatch": ["cat"]
      }
    },
    {
      "id": 8,
      "code": "dolphin",
      "name": "イルカ星紋タイプ",
      "title": "ハッピームードメーカー",
      "summary": "明るさと社交性に恵まれ、場の雰囲気を一気に変える力を持つ星紋タイプです。人と楽しい時間を共有することが何よりのエネルギー源になります。",
      "personality": "好奇心旺盛でノリも良く、思いついたらすぐ動けるフットワークの軽さがあります。その一方で、退屈やマンネリを嫌い、刺激を求めすぎてペースを乱すこともあります。",
      "loveStyle": "恋愛では楽しく過ごせることを重視し、会話が弾む相手や一緒に遊べる相手に惹かれます。テンションが合う相手とは一気に距離が縮まりやすいタイプです。",
      "workStyle": "人と関わる仕事や、アイデアを出す場面で力を発揮します。営業や接客、イベント企画、クリエイティブ系など、動きのある仕事との相性が良いでしょう。",
      "stressSigns": "単調な作業が続いたり、感情を押し殺し続けるとストレスが溜まりやすくなります。笑顔が減ってきたときは、心が疲れているサインです。",
      "healingTips": "気を使わずに笑える相手と過ごしたり、好きな音楽や趣味で思い切りリフレッシュすることが大切です。短い時間でも楽しい予定を入れるだけで、気持ちが軽くなります。",
      "lifeStory": {
        "childhood": "子どもの頃から友だちと遊ぶのが好きで、クラスのムードメーカーになりやすい星紋です。明るさと愛嬌で周りに人が集まりやすいタイプです。",
        "teen": "10代は、部活やイベントなど人が集まる場で力を発揮しやすい時期です。反面、自分の感情を深く見つめる時間が不足しがちになることもあります。",
        "twenties": "20代は、多くの人や場所に触れて経験値を増やす時期です。さまざまな出会いの中で、自分にとって本当に心地よい人間関係がどんなものかが見えてきます。",
        "thirties": "30代は、楽しいだけのつながりから、安心して本音を出せるつながりへとシフトしていくステージです。仕事でも、長く付き合う人や場所が決まりやすいタイミングです。",
        "fortiesPlus": "40代以降は、明るさと柔軟さが周りの人を励ます力になります。自分のペースで楽しみを見つけながら、人とのつながりを育てていける星紋です。"
      },
      "marriageChances": [
        {
          "label": "20〜23歳ごろ",
          "text": "友人関係から恋愛に発展しやすい時期で、一緒にいて楽しく過ごせる相手とのご縁が生まれやすいタイミングです。恋愛を通じて、自分が本当に求める関係性が見えてきます。"
        },
        {
          "label": "26〜29歳ごろ",
          "text": "遊びから落ち着いた付き合いへと意識が変わりやすい時期です。将来を考えても安心できる相手とのご縁が強まります。"
        },
        {
          "label": "32〜36歳ごろ",
          "text": "仕事や生活の基盤が整い、安心して笑い合えるパートナーとの出会いが結婚につながりやすい時期です。友人の紹介や飲み会、イベントなどがきっかけになりやすいでしょう。"
        },
        {
          "label": "41〜44歳ごろ",
          "text": "人生を一緒に楽しめる第二のパートナーとのご縁が生まれやすいタイミングです。若い頃とは違う落ち着いた楽しさを共有できる相手が現れやすい星回りです。"
        }
      ],
      "turningPoints": [
        {
          "ageHint": "20代前半",
          "text": "楽しいだけの関係と、本当に安心できる関係の違いを知るターニングポイントです。ここでの気づきが、その後の恋愛観に大きく影響します。"
        },
        {
          "ageHint": "30歳前後",
          "text": "楽しさと安定のバランスをどう取るかを決める時期です。仕事や恋愛で、無理をして盛り上げ役を続けないことが大切になります。"
        },
        {
          "ageHint": "40代前半",
          "text": "自分を楽しませることと、人を楽しませることの両方を大切にするフェーズへの切り替え時期です。心から笑える時間を自分にも用意することがテーマになります。"
        }
      ],
      "compatibility": {
        "goodMatchLove": ["cat", "dog", "fox"],
        "bestMarriage": ["dog", "penguin"],
        "excitingButTiring": ["wolf", "fox"],
        "difficultMatch": ["owl"]
      }
    },
    {
      "id": 9,
      "code": "penguin",
      "name": "ペンギン星紋タイプ",
      "title": "チームプレイヤー",
      "summary": "仲間意識が強く、チームで動くことで力を発揮する星紋タイプです。協調性と責任感があり、一緒に何かを成し遂げることに喜びを感じます。",
      "personality": "自分一人だけが目立つのではなく、周囲と足並みを揃えながら進んでいくことを好みます。その一方で、人に合わせすぎて自分の本音を後回しにすることもあります。",
      "loveStyle": "恋愛では、友達の延長線上のような、自然体でいられる関係を望みます。日常生活を一緒に楽しめる相手との相性が良く、同じ目標に向かって協力し合えるパートナーシップを築きやすいタイプです。",
      "workStyle": "チームで動く仕事や、調整役が必要な場面で力を発揮します。組織の一員として全体を見ながら動くことが得意で、職場で信頼を集めやすいでしょう。",
      "stressSigns": "責任感が強いため、周りの問題を自分のせいだと感じやすい傾向があります。自分だけが頑張っていると感じたときに、心が疲れやすくなります。",
      "healingTips": "本音を話せる仲間との時間や、役割を忘れて過ごせる趣味の時間を持つことで心が軽くなります。完璧なチームを目指さず、できる範囲で貢献することを許すと楽になります。",
      "lifeStory": {
        "childhood": "子どもの頃から友だちと協力して遊ぶことが多く、グループ行動に馴染みやすい星紋です。一人ではなく誰かと一緒にいることで安心感を得やすいタイプです。",
        "teen": "10代は、部活やクラス活動などで仲間とともに目標に向かう経験をしやすい時期です。そこでの成功体験や挫折が、チームに対する思いに影響を与えます。",
        "twenties": "20代は、職場やコミュニティの中で、自分がどう役に立てるかを模索するタイミングです。所属する場所によって、やりがいの感じ方が大きく変わります。",
        "thirties": "30代は、チームの中での自分のポジションが固まっていくステージです。家庭においても、パートナーや家族と役割分担をしながら安定を築いていきます。",
        "fortiesPlus": "40代以降は、チームを支える側やまとめ役として活躍する場面が増えていきます。経験に基づいた判断力で、周囲から頼られる存在になる星紋です."
      },
      "marriageChances": [
        {
          "label": "22〜25歳ごろ",
          "text": "職場やサークルなど、同じ目標に向かう相手とのご縁が生まれやすい時期です。一緒に頑張るうちに、自然と恋愛感情が芽生えやすい流れがあります。"
        },
        {
          "label": "28〜31歳ごろ",
          "text": "仕事や生活のリズムが安定してきて、結婚を現実的に考えやすいタイミングです。日常を一緒に積み重ねていける相手とのご縁が強まります。"
        },
        {
          "label": "34〜38歳ごろ",
          "text": "家族やパートナーとのチーム感を重視したくなる時期です。支え合える関係を築ける相手との出会いや、既存の関係の進展が期待できます。"
        },
        {
          "label": "43〜46歳ごろ",
          "text": "第二の人生のパートナーとして、お互いの過去を理解したうえで歩んでいける相手とのご縁が生まれやすい星回りです。"
        }
      ],
      "turningPoints": [
        {
          "ageHint": "20代前半",
          "text": "どんなチームやコミュニティに所属するかを決めるターニングポイントです。ここでの選択が、その後の人間関係の質に大きく影響します。"
        },
        {
          "ageHint": "30歳前後",
          "text": "自分の役割を見直し、無理なく貢献できる形を探る時期です。チームのために頑張りすぎないバランス感覚が求められます。"
        },
        {
          "ageHint": "40代前半",
          "text": "チームの一員から、チームを支える立場へのシフトが起きやすい節目です。背負いすぎず、人を育てる視点を持つことがテーマになります。"
        }
      ],
      "compatibility": {
        "goodMatchLove": ["dog", "cat", "squirrel"],
        "bestMarriage": ["cat", "dog", "bear"],
        "excitingButTiring": ["fox", "dolphin"],
        "difficultMatch": ["wolf"]
      }
    },
    {
      "id": 10,
      "code": "wolf",
      "name": "オオカミ星紋タイプ",
      "title": "フロンティアリーダー",
      "summary": "自分の信念やスタイルを大切にし、道なき道を切り開いていく星紋タイプです。群れの中で埋もれるよりも、自分らしいやり方で勝負したい気持ちが強くあります。",
      "personality": "独立心が強く、他人の評価よりも自分の納得感を優先します。周囲からはクールに見られがちですが、内側には熱い情熱を秘めています。",
      "loveStyle": "恋愛では、依存し合う関係よりも、お互いが自立したうえで支え合うパートナーシップを求めます。尊敬できる相手や、同じ方向を見て歩ける相手に惹かれるタイプです。",
      "workStyle": "ルールに縛られすぎない環境や、自分の裁量で動ける仕事に向いています。起業やフリーランス、リーダー職など、自ら責任を負う立場で力を発揮しやすいでしょう。",
      "stressSigns": "細かい指示やルールが多すぎると、やる気が一気に落ちてしまいます。また、自分の意思を無視される状況が続くと、心が冷めていきます。",
      "healingTips": "短くても構わないので、自分のペースで動ける時間や、自分発信で何かを決められる場を持つことが大切です。自分の信念や目標を紙に書き出すことで、軸が整いやすくなります。",
      "lifeStory": {
        "childhood": "子どもの頃から自分の世界観やこだわりがはっきりしており、周りと同じであることにあまり魅力を感じない星紋です。",
        "teen": "10代は、周囲との違いを強く意識し、自分らしさと馴染むことのバランスに悩みやすい時期です。ここでの葛藤が、後の独自性につながっていきます。",
        "twenties": "20代は、組織の中での違和感や窮屈さを通して、自分の理想の働き方や生き方を模索するタイミングです。挑戦を通じて経験値を積んでいきます。",
        "thirties": "30代は、自分のスタイルを固め、ある程度のリスクを受け入れながら挑戦するステージです。独立や転職、大きな方向転換が起こりやすい時期でもあります。",
        "fortiesPlus": "40代以降は、切り開いてきた経験をもとに、後輩や周りを導く立場になることが増えていきます。自分の信念を持ちながらも、人の意見にも耳を傾けられるリーダーとして輝きやすい星紋です。"
      },
      "marriageChances": [
        {
          "label": "23〜26歳ごろ",
          "text": "自分の生き方に影響を与えてくれるような、刺激的で魅力的な相手とのご縁が生まれやすい時期です。価値観のぶつかり合いを通して絆が深まることもあります。"
        },
        {
          "label": "29〜33歳ごろ",
          "text": "自由と安定のバランスを現実的に考えるようになるタイミングです。自分のスタイルを尊重しつつ支えてくれるパートナーとのご縁が強まります。"
        },
        {
          "label": "36〜40歳ごろ",
          "text": "仕事や挑戦をひと区切りさせ、これからの人生を一緒に歩んでいける相手を求めやすい時期です。対等な関係を築けるパートナーとの出会いが期待できます。"
        },
        {
          "label": "44〜47歳ごろ",
          "text": "自分の信念を共有できる第二のパートナーとのご縁が生まれやすい星回りです。過去の経験を互いに理解し合える関係が結婚につながりやすいでしょう。"
        }
      ],
      "turningPoints": [
        {
          "ageHint": "20代後半",
          "text": "組織に合わせるか、自分のスタイルで生きるかの方向性を決めるターニングポイントです。ここでの決断が、その後の自由度に大きく影響します。"
        },
        {
          "ageHint": "30代前半",
          "text": "挑戦の中で、自分の限界と強みを具体的に知る時期です。一度立ち止まって戦略を練り直すことで、次の飛躍につながります。"
        },
        {
          "ageHint": "40代前半",
          "text": "個人としての成功から、人を導いたり支えたりする役割へのシフトが起こりやすい節目です。孤独に戦うより、仲間とともに進むフェーズへと移行していきます。"
        }
      ],
      "compatibility": {
        "goodMatchLove": ["fox", "owl", "dolphin"],
        "bestMarriage": ["fox", "owl"],
        "excitingButTiring": ["cat", "dog"],
        "difficultMatch": ["penguin"]
      }
    },
    {
      "id": 11,
      "code": "koala",
      "name": "コアラ星紋タイプ",
      "title": "ゆるふわヒーラー",
      "summary": "ふんわりとした空気感と癒しのムードをまとい、周りの人をほっとさせる星紋タイプです。争いごとを好まず、穏やかな時間や空間を大切にします。",
      "personality": "マイペースで、急かされるよりも自分のリズムで動きたいタイプです。鋭くはないように見えても、人の変化や感情には意外とよく気づいています。",
      "loveStyle": "恋愛では、安心して甘えられる関係や、ゆったりとした時間を共有できる相手に惹かれます。スピード感のある恋よりも、自然体で一緒にいられるかどうかを大事にします。",
      "workStyle": "自分のペースでじっくり取り組める仕事との相性が良いです。ノルマやプレッシャーが強すぎる環境よりも、落ち着いた職場で能力を発揮しやすいでしょう。",
      "stressSigns": "急な予定変更や、常に時間に追われる生活が続くとストレスが溜まりやすくなります。気づかないうちに疲れを溜め込み、何もしたくなくなることもあります。",
      "healingTips": "何もしない時間を罪悪感なしに確保することが大切です。ぬるめのお風呂や好きな香り、柔らかい寝具など、五感が落ち着く環境を整えることで心も回復していきます。",
      "lifeStory": {
        "childhood": "子どもの頃からのんびりしていると言われやすく、自分のペースで好きなことを楽しむ星紋です。焦らされると反発したくなる一面もあります。",
        "teen": "10代は、周りのスピードに合わせようとして疲れてしまうこともあります。自分のリズムを守りながら、人との付き合い方を模索していく時期です。",
        "twenties": "20代は、どの程度のペースで働き、生きていくかの感覚をつかむタイミングです。無理をすると体やメンタルにサインが出やすく、それを通して自分の限界を知ることになります。",
        "thirties": "30代は、自分が心地よくいられる生活スタイルや人間関係を優先して選び直すステージです。ペースの合わない環境から離れる決断が、後の安定につながります。",
        "fortiesPlus": "40代以降は、自分らしいゆったりした生き方が周りにも良い影響を与えていきます。無理のないペースで人と関わりながら、穏やかな時間を育てていける星紋です。"
      },
      "marriageChances": [
        {
          "label": "21〜24歳ごろ",
          "text": "優しく穏やかな相手とのご縁が生まれやすい時期です。友達づきあいから自然に距離が縮まり、ゆったりした恋愛関係になりやすい流れがあります。"
        },
        {
          "label": "27〜31歳ごろ",
          "text": "生活のペースや価値観が近い相手との出会いが結婚につながりやすいタイミングです。同棲や結婚についての話が具体的に進みやすい時期です。"
        },
        {
          "label": "34〜38歳ごろ",
          "text": "無理なく一緒にいられる相手を選びやすくなる時期です。安心できる関係性を最優先にできるため、結果として長く続くパートナーシップにつながりやすい星回りです。"
        },
        {
          "label": "42〜45歳ごろ",
          "text": "穏やかな第二のパートナーとのご縁が生まれやすいタイミングです。派手さはなくても、心から落ち着ける関係を築きやすい時期です。"
        }
      ],
      "turningPoints": [
        {
          "ageHint": "20代半ば",
          "text": "自分のペースを無視した生活を続けると限界が見えるターニングポイントです。ここでの経験をきっかけに、無理を減らす選択へとシフトしやすくなります。"
        },
        {
          "ageHint": "30代前半",
          "text": "ペースの合う人や環境を選び直す時期です。ゆったりした暮らしや、余白のある時間を意識的に増やすことで、心身の安定が高まります。"
        },
        {
          "ageHint": "40代前半",
          "text": "自分にとってほんとうに心地よいことだけを残し、それ以外を手放すフェーズです。スローダウンすることで、逆に人生の満足度が上がっていきます。"
        }
      ],
      "compatibility": {
        "goodMatchLove": ["cat", "dog", "rabbit"],
        "bestMarriage": ["bear", "cat"],
        "excitingButTiring": ["dolphin", "fox"],
        "difficultMatch": ["wolf"]
      }
    },
    {
      "id": 12,
      "code": "hedgehog",
      "name": "ハリネズミ星紋タイプ",
      "title": "繊細ガードタイプ",
      "summary": "繊細な感性を持ちながら、自分を守るためのトゲも持っている星紋タイプです。慣れるまでは距離を取りますが、一度心を許した相手には深い愛情と忠誠心を見せます。",
      "personality": "警戒心が強く、初対面では様子を見ることが多いタイプです。自分の世界や時間を大切にしており、踏み込みすぎられるとトゲを立ててしまうこともあります。",
      "loveStyle": "恋愛では、信頼関係ができるまで時間がかかるものの、心を許した相手にはとても一途です。安心して弱さを見せられる相手との相性が良く、押しの強すぎる相手は苦手です。",
      "workStyle": "静かな環境で、集中して取り組める仕事との相性が良いです。細かい作業や、品質を守る役割など、自分のペースで丁寧に進められる分野で力を発揮します。",
      "stressSigns": "急な変化や、プライベートな領域に踏み込まれすぎるとストレスが溜まりやすくなります。防御反応として、連絡を断ったり、急に距離を置きたくなることもあります。",
      "healingTips": "一人で落ち着ける時間や場所を確保することが重要です。自分から心を開いて話せる相手を一人でも持つことで、防御のトゲを少しずつ緩めていけます。",
      "lifeStory": {
        "childhood": "子どもの頃から慎重で、人見知りをしやすい星紋です。慣れた環境や信頼できる人のそばで力を発揮しやすいタイプです。",
        "teen": "10代は、周りとの違いを意識して、自分の殻にこもりがちになることもあります。自分を分かってくれる人の存在が大きな支えになります。",
        "twenties": "20代は、外の世界に挑戦しつつ、自分の安全基地を探す時期です。居心地の良い場所と、そうでない場所の違いがはっきりしてきます。",
        "thirties": "30代は、自分を守るトゲと、人とつながるための柔らかさのバランスを整えるステージです。少数でも信頼できる人間関係を深めていく流れが訪れます。",
        "fortiesPlus": "40代以降は、自分なりの距離感の保ち方を身につけ、無理なく人と関われるようになっていきます。繊細さが、周りの人への思いやりとして活かされる星紋です。"
      },
      "marriageChances": [
        {
          "label": "24〜27歳ごろ",
          "text": "慎重な自分を受け止めてくれる相手とのご縁が生まれやすい時期です。時間をかけて信頼関係を築ける恋愛が結婚につながりやすい流れです。"
        },
        {
          "label": "30〜34歳ごろ",
          "text": "自分を守ることと、人と一緒に生きることのバランスを考えやすくなるタイミングです。安心して弱さを見せられるパートナーとのご縁が強まります。"
        },
        {
          "label": "37〜40歳ごろ",
          "text": "人生経験を通じて、自分に合う距離感を理解してくれる相手との出会いが期待できる時期です。再会や紹介からのご縁も入りやすい星回りです。"
        },
        {
          "label": "44〜47歳ごろ",
          "text": "無理をしないパートナーシップを築ける第二のご縁が生まれやすいタイミングです。お互いのペースを尊重し合える関係が結婚につながりやすいでしょう。"
        }
      ],
      "turningPoints": [
        {
          "ageHint": "20代半ば",
          "text": "自分の殻を守るだけでなく、少しだけ外に開いてみることを学ぶターニングポイントです。小さな一歩が、大きな安心感につながるきっかけになります。"
        },
        {
          "ageHint": "30代前半",
          "text": "信頼できる人との深い絆を育てていく時期です。数より質を重視することで、心の安定が増していきます。"
        },
        {
          "ageHint": "40代前半",
          "text": "トゲを立てなくても自分を守れる方法を身につける節目です。距離感の取り方や境界線の引き方を見直すことで、人間関係が楽になっていきます。"
        }
      ],
      "compatibility": {
        "goodMatchLove": ["owl", "rabbit", "koala"],
        "bestMarriage": ["owl", "bear"],
        "excitingButTiring": ["fox", "squirrel"],
        "difficultMatch": ["dog"]
      }
    }
  ]
}
